function mergeAndUnique(arr1, arr2) {
  const arr = [...arr1, ...arr2];

  const uniqueArr = [...new Set(arr.map((item) => item.screen_name))];

  const result = uniqueArr.map((name) => {
    const item1 = arr1.find((item) => item.screen_name === name);
    const item2 = arr2.find((item) => item.screen_name === name);
    return { ...item1, ...item2 };
  });

  return result;
}

// excute once
const words = (function () {
  const keywordsString =
    "！|弟弟小|昂撒|台独|小日本|找死|主子|数典忘祖|假新闻|挑事|哟|天塌不下来|绿党|圣母|种性别|保姆级|单亲|线下|同城|已婚|一面之词|贱民|哈哈哈|呵呵呵|上天|婊|鸟样|什么逼|什么傻|装什么|装TM|牛批|呆蛙|妓|妓者|有毛病|有病|😄|粪|牛b|它妈|献忠|东亚病夫|https://t.co|他娘|怎么不|这孙子|下地狱|你哪里来的|你哪来的|霉国|米国|宰割|我tm|奶奶个球|狠狠|握草|丑国|今天星期|今天周|个逼|留岛|老实|死绝|死路|造谣|nm的|CNM|蹦哒|个锤子|哔哔|炮制|世纪谎言|支人|暖心|大纪元|应得的|脑子|二逼|二货|台湾省|是中国的|管好|脸都|狗|去你|关你|抹黑|💞|老鸨|嫂子|裱子|境外势力|屁|带节奏|有故事|双标|织女|没事干|滞纳|逼逼|b脸|逼脸|小编|瞎|扯淡|灯塔|白皮|鬼子|老美|磨叽|几把|咋呼|煽风点火|美帝|J8|阳痿|呵呵|啥|嘿嘿|丫的|你丫|他娘|蛆|个吊|特么|老不死|实锤|🐸|蛙蛙|口嗨|嘴炮|✊ ✊ ✊‏|笑死|有一说一|意淫|牛逼|毛线|胡说|我擦|我靠|呸|蛙编|看不到的新闻|个屁|MLGB|交友|性瘾|电报|已婚|代开发票|学信网黑客|变性|傀儡|白左|黄左|政治正确|黑命贵|🇨🇳🇭🇰🇲🇴🏁|🇨🇳|qnmlgb|尼玛|🤮|滚蛋|黑鬼|畜牲|你大|畜生|傻逼|死全家|狗东西|脑残|废物|妈的|草泥马|操你妈|日你妈|狗日的|河南银行|村镇银行|呸|中国河南|王八蛋|煞笔|二逼|贱人|狗屎|滚蛋|死全家|傻叉|装B|王八蛋|贱货|狗屎|垃圾|个P|狗P|个鬼|被你吃了|狗屁|丢人现眼|去死|垃圾|废物|白痴|蠢货|傻逼|滚蛋|草泥马|二百五|王八蛋|贱货|婊子|绿茶婊|神经病|死鬼|杂种|妈逼|日你妈|操你妈|操你祖宗十八代|操你全家|干你娘|草你妈|草泥马的|操蛋|操屄|操逼|吃屎|日死你|日你祖宗十八代|日你全家|干死你|干你祖宗十八代|干你全家|草死你|草你祖宗十八代|草你全家|艹你妈|艹死你|混蛋|败类|烂人|贱人|恶心|变态|不要脸|下流|死全家|王八蛋|傻逼|装B|妓女|卖淫|婊子|毒瘤|垃圾|垃圾人|死基佬|人妖|阴阳人|娘娘腔|假小子|娘们|娘娘们|婊子|骚货|屎|滥交|狗日|操你|妓女|鸡巴|屁眼|烂货|贱人|滚蛋|死开|傻逼|煞笔|妈的|操你妈|草你妈|王八蛋|贱货|二逼|白痴|脑残|傻瓜|混蛋|变态|搞基|同性恋|基佬|蕾丝边|妖姬|妖精|妖娆|妖艳|妖冶|妖异|妖孽|妖魔|妖狐|妖怪|太监|人渣|狗娘养的|傻屌|神经病|白痴|脑残|懒猪|傻瓜|笨蛋|憨批|瘪三|傻子|二逼|呆子|蠢货|煞笔|懒鬼|废物|懒汉|猪头|下流|草泥马|操你妈|脑残|神经病|白痴|混蛋|人渣|骗子|假货|欺诈|弱智|无耻|恶心|坏蛋|败类|流氓|恶棍|别废话|窝囊|颜色革命|毒瘤|卑鄙|阴险|险恶|肮脏|龌龊|恶劣|牛屎|之阴|大外宣|劣等|民逗|左棍|人类之癌|造孽|蛆虫|牛鬼神蛇|不男不女|畜生|卖国贼|汉奸|叛徒|狗娘养的|狗屎|垃圾|混蛋|败类|烂人|贱人|鬼佬|尼哥|恶心|变态|不要脸|下流|死全家|王八蛋|傻逼|娘炮|变态|变性人|垃圾|傻逼|煞笔|狗屎|狗日的|王八蛋|贱人|婊子|滚开|滚粗|去死|死了|死掉|死人|肏|屌|鸡巴|妓女|骚货|放屁|傻子|白痴|脑残|弱智|没脑子|懒得理你|不想理你|不爱理你|不理你|闭嘴|低能|一辈子出不了头|天生犯贱|一无是处|不自量力|支那|黑鬼|阿三|台巴子|台蛙|个SB|个sb|煞笔|妈的|操|草泥马|傻逼|贱人|货色|作孽|左逼|左B|左b|屁话|P话|吊样|阿鸡|阿猫|阿狗|垃圾|畜生|死全家|混蛋|苟且偷安|过河拆桥|反面教材|背影般离去|笨蛋|废物|无能|蠢驴|畜生|混蛋|家伙|庸才|二五仔|小丑|败家子|败家玩意|败家东西|笨蛋|魏家鼠|害人精|害群之马|无赖|屁精|饭桶|笨猪|带病的|异类|不三不四|人渣|好色之徒|死变态|异类|太自私|最讨厌你|恶心死了|滚回你妈肚子里去|滚回你家|走开|别来烦我|滚出|别在我面前出现|离我远点|消失|消失吧|装B|妓女|卖淫|婊子|毒瘤|垃圾|垃圾人|人渣|神经病|白痴|脑残|懒猪|傻瓜|笨蛋|憨批|瘪三|傻子|二逼|呆子|蠢货|丧尽天良|狗眼看人低|不要脸|小人|奸商|败家子|傻缺|脸皮厚|煞笔|懒鬼|废物|懒汉|猪头|反人类|反动派|恶霸|走狗|大忽悠|国贼|独裁者|专制者|暴君|伪君子|黑鬼|支那|毛子|阿三|鬼佬|阿巴|窝囊废|二逼|煞笔|傻逼|脑残|白痴|废物|没用|死全家|滚蛋|去死|死了|死掉|死人|劣人|烂人|骚货|婊子|支那|你妈|活该|该死|杂交|变态|福利|粉丝|瑟瑟|线下|附近|多人运动|羞羞|接推广|口令|支付宝|发泄|欲望|老师|释放|老司机|结婚|素质男|电报|无码|门槛|长期固定|反差|绿帽|流出|素人|小视频|换脸|羞辱|未满|色情|黄色|裸体|性瘾|单亲|妈妈|阿姨|空姐|护士|幼师|开放|性交|性爱|口交|乳交|阴道|阴茎|胸部|乳房|乳头|肛交|卖淫|妓女|嫖娼|性服务|性交易|性骚扰|淫秽|淫乱|援交|做爱|SM|调教|肛门|乱伦|迷奸|强奸|春药|裸照|激情|情色|伦理|三级|AV女优|AV男优|性感|诱惑|约炮|性器|性行为|性高潮|xxoo|处女|处男|婬|鸡巴|阴囊|阴部|阴唇|深喉|乳沟|双乳|脱衣|自慰|生殖器|性器官|色诱|情欲|色色|肉体|性生活|淫荡|滥交|嫖客|猥亵|裸体照片|艳照|色狼|换妻|出轨|同房|电影色情|爱爱|现代情色|文学情色|丝袜|少妇|熟女|SM调教|SM舞会|SM虐恋|SM全明星|吞精|小姐|性虐待|偷窥|淫水|性欲|轮奸|换媳|脱裤|阴道口|阳具|阴茎勃起|高潮|兽交|各种姿势|快乐女生|少男少女|美女图片|少女之心|拉拉香港|伦图|鬼畜抄|淫赶|三陪|强制UP主|高清性愛|性爱图|性爱视|性爱小电影|性爱动态图|性爱动漫|性爱姿势|性爱插图|成人文学|成人漫画|成人小说|情色视频|情色图片|裸聊|裸聊视频|论坛|淫兽|淫虫|淫蕩|淫妇|淫姐|淫浪|淫流|淫糜|淫魔|淫母|淫女|淫妻|淫情|淫肉|淫乳|淫色|淫声|淫娃|淫液|淫照|幼齿|幼交|幼女|梦幻西游性爱版|禁室培欲|性感沙滩|美女斗地主|少妇自慰|人妻熟女|寂寞少妇|美女裸聊|日本AV女优|日本拉拉|日本SM调教|色即是空|四房色播|爱情岛论坛|爽死我了|男女公关|欧美BT|成人杂志|激情打炮|性息|成人用品|情趣内衣|情色成人|视频聊天|咪咕聊天|视频美女|一夜情|性伴侣|性骚扰|两性知识|成年片|情色电影|成人电影|成人片|鸡吧|肛洞|双峰|领土拍卖|乳神|肉弹|蹄击肉|陰核|摸奶门|咪咪|肉缝|破处|幼b|幼逼|偷拍|无码|有码|魅惑|情色小说|日本AV|无码AV|黄色网站|性爱电影|免费A片|性爱图片|性交图片|人体摄影|艳舞女郎|淫乱熟女|人皮面具|嫩B|淫虫电影|日本淫荡美少女|日本淫电影|肛门喷水|菊花洞|腋毛女|颜射|淫荡笑话|酒瓶插入|乳晕|春宫|骚女|背德|美少女|乱交|AV女优|爱爱视频|性爱贴图|按摩棒|拔出来|爆草|包二奶|暴干|暴奸|暴乳|爆乳|暴淫|屄|被操|被插|被干|逼奸|仓井空|插暴|操逼|操黑|操烂|肏你|肏死|操死|操我|厕奴|插比|插b|插逼|插进|插你|插我|插阴|潮吹|潮喷|成人dv|成人电影|成人论坛|成人小说|成人电|成人电影|成人卡通|成人聊|成人片|成人视|成人图|成人文|成人小|成人电影|成人论坛|成人色情|成人网站|成人文学|成人小说|艳情小说|成人游戏|吃精|赤裸|抽插|扌由插|抽一插|春药|大波|大力抽送|大乳|荡妇|荡女|盗撮|多人轮|发浪|放尿|肥逼|粉穴|封面女郎|风月大陆|干死你|干穴|肛交|肛门|龟头|裹本|国产av|好嫩|豪乳|黑逼|后庭|后穴|虎骑|花花公子|换妻俱乐部|黄片|几吧|鸡吧|鸡巴|鸡奸|寂寞男|寂寞女|妓女|激情|集体淫|奸情|叫床|脚交|金鳞岂是池中物|金麟岂是池中物|精液|就去日|巨屌|菊花洞|菊门|巨奶|巨乳|菊穴|开苞|口爆|口活|口交|口射|口淫|裤袜|狂操|狂插|浪逼|浪妇|浪叫|浪女|狼友|聊性|流淫|铃木麻|凌辱|漏乳|露b|乱交|乱伦|轮暴|轮操|轮奸|裸陪|买春|美逼|美少妇|美乳|美腿|美穴|美幼|秘唇|迷奸|密穴|蜜穴|蜜液|摸奶|摸胸|母奸|奈美|男奴|内射|嫩逼|嫩女|嫩穴|捏弄|女优|炮友|砲友|喷精|屁眼|品香堂|前凸后翘|强jian|强暴|强奸处女|情趣用品|情色|拳交|全裸|群交|惹火身材|人妻|人兽|日逼|日烂|肉棒|肉逼|肉唇|肉洞|肉缝|肉棍|肉茎|肉具|揉乳|肉穴|肉欲|乳爆|乳房|乳沟|乳交|乳头|三级片|骚逼|骚比|骚女|骚水|骚穴|色逼|色界|色猫|色盟|色情网站|色区|色色|色诱|色欲|色b|少年阿宾|少修正|射爽|射颜|食精|释欲|兽奸|兽交|手淫|兽欲|熟妇|熟母|熟女|爽片|爽死我了|双臀|死逼|丝诱|松岛枫|酥痒|汤加丽|套弄|体奸|体位|舔脚|舔阴|调教|偷欢|偷拍|推油|脱内裤|文做|我就色|无码|舞女|无修正|夏川纯|相奸|小逼|校鸡|小穴|小xue|写真|性感妖娆|性感诱惑|性虎|性饥渴|性技巧|性交|性奴|性虐|性息|性欲|胸推|穴口|学生妹|穴图|亚情|颜射|阳具|杨思敏|要射了|夜勤病栋|一本道|一夜欢|一夜情|一ye情|阴部|淫虫|阴唇|淫荡|阴道|淫电影|阴阜|淫妇|淫河|阴核|阴户|淫贱|淫叫|淫教师|阴茎|阴精|淫浪|淫媚|淫糜|淫魔|淫母|淫女|淫虐|淫妻|淫情|淫色|淫声浪语|同城|淫兽学园|淫书|淫术炼金士|淫水|淫娃|淫威|淫亵|淫样|淫液|淫照|阴b|应召|幼交|幼男|幼女|欲火|欲女|玉女心经|玉蒲团|玉乳|欲仙欲死|玉穴|援交|原味内衣|援助交际|张筱雨|招鸡|招妓|中年美妇|抓胸|自拍|自慰|作爱|18禁|99bb|anal|a片|fuck|gay片|g点|g片|hardcore|h动画|h动漫|incest|porn|secom|sexinsex|sm女王|xiao77|xing伴侣|tokyohot|yin荡|贱人|装b|大sb|傻逼|傻b|煞逼|煞笔|刹笔|傻比|沙比|欠干|婊子养的|我日你|我操|我草|卧艹|卧槽|爆你菊|艹你|cao你|你他妈|真他妈|别他吗|草你吗|草你丫|操你妈|擦你妈|操你娘|操他妈|日你妈|干你妈|干你娘|娘西皮|狗操|狗草|狗杂种|狗日的|操你祖宗|操你全家|操你大爷|妈逼|你麻痹|麻痹的|妈了个逼|马勒|狗娘养|贱比|贱b|下贱|死全家|全家死光|全家不得好死|全家死绝|白痴|无耻|sb|杀b|你吗b|你妈的|婊子|贱货|人渣|混蛋|媚外|和弦|兼职|限量|铃声|性伴侣|男公关|火辣|精子|射精|诱奸|强奸|做爱|性爱|发生关系|按摩|快感|处男|猛男|少妇|屌|屁股|下体|a片|内裤|浑圆|咪咪|发情|刺激|白嫩|粉嫩|兽性|风骚|呻吟|sm|阉割|高潮|裸露|不穿|一丝不挂|脱光|干你|干死|我干|裙中性运动|乱奸|乱伦|乱伦类|乱伦小|伦理大|伦理电影|伦理毛|伦理片|裸聊|裸聊网|裸体写真|裸舞视|裸照|美女裸体|美女写真|美女上门|美艳少妇|妹按摩|妹上门|迷幻药|迷幻藥|迷昏口|迷昏药|迷昏藥|迷魂香|迷魂药|迷魂藥|迷奸粉|迷奸药|迷情粉|迷情水|迷情药|迷药|迷藥|谜奸药|骚妇|骚货|骚浪|骚女|骚嘴|色电影|色妹妹|色情表演|色情电影|色情服务|色情图片|色情小说|色情影片|色情表演|色情电影|色情服务|色情片|色视频|色小说|性伴侣|性服务|性福情|性感少|性伙伴|性交|性交视频|性交图片|性奴|性奴集中营|性虐|阴唇|阴道|阴蒂|阴户|阴间来电|阴茎|阴茎增大|阴茎助勃|阴毛|陰唇|陰道|陰戶|淫荡|淫荡美女|淫荡视频|淫荡照片|淫乱|淫靡|淫魔|淫魔舞|淫女|淫情女|淫肉|淫騷妹|淫兽|淫兽学|淫水|淫穴|morphine|摇头丸|迷药|乖乖粉|narcotic|麻醉药|精神药品|爱女人|爱液|按摩棒|拔出来|爆草|包二奶|暴干|暴奸|暴乳|爆乳|暴淫|屄|被操|被插|被干|逼奸|仓井空|插暴|操逼|操黑|操烂|肏你|肏死|操死|操我|厕奴|插比|插b|插逼|插进|插你|插我|插阴|潮吹|潮喷|成人电影|成人论坛|成人色情|成人网站|成人文学|成人小说|艳情小说|成人游戏|吃精|赤裸|抽插|扌由插|抽一插|春药|大波|大力抽送|大乳|荡妇|荡女|盗撮|多人轮|发浪|放尿|肥逼|粉穴|封面女郎|风月大陆|干死你|干穴|肛交|性爱|肛门|龟头|裹本|国产av|好嫩|豪乳|黑逼|后庭|后穴|虎骑|花花公子|换妻俱乐部|黄片|几吧|鸡吧|鸡巴|鸡奸|寂寞男|寂寞女|妓女|激情|集体淫|奸情|叫床|脚交|金鳞岂是池中物|金麟岂是池中物|精液|就去日|巨屌|菊花洞|菊门|巨奶|巨乳|菊穴|开苞|口爆|口活|口交|口射|口淫|裤袜|狂操|狂插|浪逼|浪妇|浪叫|浪女|狼友|聊性|流淫|铃木麻|凌辱|漏乳|露b|乱交|乱伦|轮暴|轮操|轮奸|裸陪|买春|美逼|美少妇|美乳|美腿|美穴|美幼|秘唇|迷奸|密穴|蜜穴|蜜液|摸奶|摸胸|母奸|奈美|奶子|男奴|内射|嫩逼|嫩女|嫩穴|捏弄|女优|炮友|砲友|喷精|屁眼|品香堂|前凸后翘|强jian|强暴|强奸处女|情趣用品|情色|拳交|全裸|群交|惹火身材|人妻|人兽|日逼|日烂|肉棒|肉逼|肉唇|肉洞|肉缝|肉棍|肉茎|肉具|揉乳|肉穴|肉欲|乳爆|乳房|乳沟|乳交|乳头|三级片|骚逼|骚比|骚女|骚水|骚穴|色逼|色界|色猫|色盟|色情网站|色区|色色|色诱|色欲|色b|少年阿宾|少修正|射爽|射颜|食精|释欲|兽奸|兽交|手淫|兽欲|熟妇|熟母|熟女|爽片|爽死我了|双臀|死逼|丝诱|松岛枫|酥痒|汤加丽|套弄|体奸|体位|舔脚|舔阴|调教|偷欢|偷拍|推油|脱内裤|文做|我就色|无码|舞女|无修正|吸精|夏川纯|相奸|小逼|校鸡|小穴|小xue|写真|性感妖娆|性感诱惑|性虎|性饥渴|性技巧|性交|性奴|性虐|性息|性欲|胸推|穴口|学生妹|穴图|亚情|颜射|阳具|杨思敏|要射了|夜勤病栋|一本道|一夜欢|一夜情|一ye情|阴部|淫虫|阴唇|淫荡|阴道|淫电影|阴阜|淫妇|淫河|阴核|阴户|淫贱|淫叫|淫教师|阴茎|阴精|淫浪|淫媚|淫糜|淫魔|淫母|淫女|淫虐|淫妻|淫情|淫色|淫声浪语|淫兽学园|淫书|淫术炼金士|淫水|淫娃|淫威|淫亵|淫样|淫液|淫照|阴b|应召|幼交|幼男|幼女|欲火|欲女|玉女心经|玉蒲团|玉乳|欲仙欲死|玉穴|援交|原味内衣|援助交际|张筱雨|招鸡|招妓|中年美妇|抓胸|自拍|自慰|作爱|18禁|99bb|a4u|a4y|adult|amateur|anal|a片|fuck|gay片|g点|g片|hardcore|h动画|h动漫|incest|porn|secom|sexinsex|sm女王|xiao77|xing伴侣|tokyohot|yin荡|认证|足交|制服|白虎|#代孕|#侮辱|#妈妈|#抚摸|#磕头|#秘书|#蒙眼|10天1cm|18禁|amateur|anal|av|a片|gay片|g点|g片|h动漫|h动画|porn|sm|telegram下载|tg下载|tg：|xing伴侣|yin荡|➕✈️|➕电报|一ye情|一ye欢|一夜情|一夜欢|万人斩|万艾可|三件套|三级|三陪|下体|不谈情|不走进生活|丝袜|丝诱|两性知识|中学老师一枚|主页私信|乖乖粉|买春|乱交|乱伦|乱奸|乳交|乳头|乳房|乳晕|乳沟|乳爆|乳神|互相倾诉一下|互相倾诉下|互相认识一下|互相认识下|亚情|人体摄影|人兽|人妻|人皮面具|从前面捅|从后面捅|代孕机构|伟哥|伦图|伦理片|伦理电影|体位|体制内老师|体制秘书|体奸|体质秘书|作爱|供卵|做爱|偷拍|偷欢|偷窥|催情药|催情辅助用品|入驻平台|全国可飞|全裸|兽交|兽奸|兽性|兽欲|内射|写真|凌辱|几吧|出轨|前凸后翘|加微信|加我主页|助勃|助孕|劲爆内容|勃起|包二奶|包选性别|千人斩|单亲|卖淫|印度三哥|厕奴|原味内衣|去衣|双乳|双峰|双性恋|双效款|双臀|反差|发情|发泄|发浪|发生关系|口交|口令|口射|口活|口淫|口爆|叫床|可以互相认识|可约|吃精|各种姿势|同城|同房|后庭|后穴|吞精|听话水|听话狗|听话的来|听话的狗|听话的🐕|听话🐕|吸精|呻吟|咪咪|哟啪|唯一 telegram|唯一 tg|唯一telegram|唯一tg|喜欢刺激|喜踩踏|喷水机|喷精|四房色播|国产AV|在主页|在编中学老师|在编小学教师|在编教师|在职中学老师|在职小学教师|在职教师|坐脸|增大|增粗|壮阳|处女|处男|多人轮|多人运动|大乳|大波|天然补品|套弄|女M|女S|女m|女s|女主人|女优|女公关|女奴|女王|女私教|女空姐|女郎|奶子|奸情|好嫩|好痒|妓女|妖娆|婊|婬|媚外|嫖娼|嫖客|嫩B|嫩b|嫩女|嫩比|嫩穴|嫩逼|学生妹|实战|客户反馈看媒体|寂寞女|寂寞男|密穴|寻m|寻s|射爽|射精|射颜|小xue|小姐姐一枚|小学教师一枚|小学语文老师|小电影|小穴|小视频|小逼|少修正|少儿不宜|少妇|少男少女|屁眼|屁股|巨乳|巨奶|巨屌|希爱力|干你|干死|干穴|年龄要求|幼b|幼交|幼女|幼师|幼比|幼男|幼逼|应召|延时|开苞|强j|强制up主|强奸|强暴|御姐资源|微密圈|必利劲|忠诚的狗狗|忠诚的🐕|快感|思想开放|性交|性伴|性器|性奴|性息|性愛|性感|性技|性服务|性欲|性爱|性生活|性瘾|性癖|性福|性虎|性虐|性行为|性运动|性饥渴|性骚扰|情欲|情色|情趣|惹火身材|懂的来|成人小说|成人文学|成人杂志|成人游戏|成人片|成人用品|成人电影|成人网站|成人论坛|成年小说|成年文学|成年杂志|成年游戏|成年片|成年用品|成年电影|成年网站|成年论坛|手淫|扌由插|打桩|打炮|扮狗|扮🐕|找个狗|找个🐕|找狗狗|找🐕|抓胸|投资孩子最好尝试|护士|抽一插|抽插|抽送|拔出来|招妓|招鸡|拳交|按摩上门|按摩棒|捆绑|捏弄|换妻|换媳|换脸|换装|接推广|推油|揉乳|插b|插你|插我|插暴|插比|插进|插逼|插阴|援交|援助交际|摸奶|摸胸|撩拔|操我|操死|操烂|操肏|操逼|操黑|放尿|无修正|无码|日烂|日逼|春宫|春药|暴乳|暴奸|暴干|暴操|暴淫|暴肏|暴艹|暴草|暴露|有点寂寞|有码|来主页|来场性|极品美女|欠干|欧美bt|欲仙欲死|欲女|欲望|欲火|死逼|母奸|每日大赛|每日疯狂大赛|洗精|流出|流淫|浪叫|浪女|浪妇|浪逼|淫书|淫乱|淫乳|淫亵|淫兽|淫叫|淫声|淫女|淫妇|淫妻|淫姐|淫威|淫娃|淫媚|淫师|淫情|淫教师|淫样|淫母|淫水|淫河|淫浪|淫液|淫照|淫片|淫电影|淫秽|淫穴|淫糜|淫肉|淫色|淫荡|淫蕩|淫虐|淫虫|淫贱|淫赶|淫靡|淫騷|淫魔|深喉|滚一滚|滚床单|滥交|漏乳|潮吹|潮喷|激情|火辣|炮友|熟女|熟妇|熟母|爆乳|爆操|爆肏|爆艹|爆草|爱液|爱爱|爽死我了|爽片|狂插|狂操|狼友|猛男|猥亵|瑜伽老师|瑟瑟|生殖器|男m|男s|男优|男公关|男奴|白嫩|白虎|百人斩|盗撮|直男醇|相奸|看主页|看我主页|砲友|破处|确定下单|福利视频|福利资源|私信主人|私信主页|私信告诉我|私信女|私信领福利|秘唇|穴口|穴图|粉嫩|粉穴|精卵|精子|精液|素人|素质男|素质约|约啪|约炮|约跑|线下|结婚|绿奴|绿帽|美乳|美女上门|美女图片|美女斗地主|美女裸体|美妇|美幼|美穴|美腿|美逼|羞羞|羞辱|群交|老司机|聊性|联系方式:|联系方式：|联系电报|肉体|肉具|肉唇|肉弹|肉棍|肉棒|肉欲|肉洞|肉穴|肉缝|肉茎|肉逼|肏你|肏死|肛交|肛洞|肛门|肥臀|肥逼|背德|胸推|胸部|脚交|脱光|脱内裤|脱衣|脱裤|腋毛女|自慰|自拍|舔脚|舔阴|舞女|色b|色区|色即是空|色妹妹|色小说|色情|色欲|色比|色狼|色猫|色电影|色界|色盟|色色|色视频|色诱|色逼|艳情|艳照|艳舞|艹死|艾力达|草死|荡女|荡妇|菊穴|菊花|菊门|萌妹资源|萝莉资源|蓝P|薄码|虎骑|蜜液|蜜穴|被干|被插|被操|裙底|裤袜|裸体照片|裸照|裸聊|裸舞|裸陪|裸露|要射了|视频美女|视频聊|视频资源|认证|试管|诱奸|诱惑|调教|谜奸药|豪乳|赤裸|足交|足控|踩头|踩背|车震|轮奸|轮操|轮暴|迷奸|迷幻药|迷幻藥|迷情水|迷情粉|迷情药|迷昏口|迷昏药|迷昏藥|迷药|迷藥|迷魂药|迷魂藥|迷魂香|逼奸|酒瓶插入|酥痒|释放|释欲|金马胶囊|针孔|针对所有男性问题|铃木麻|长期m|长期s|长期固定|长期的m|长期的s|门槛|阳具|阴b|阴唇|阴囊|阴户|阴核|阴比|阴毛|阴精|阴茎|阴蒂|阴逼|阴道|阴部|阴阜|阿姨|附近加我电报|陰唇|陰戶|陰核|陰道|集体淫|需要的主页简介|露b|靠谱狗|靠谱的狗|靠谱的🐕|靠谱🐕|鞭打|领取福利|颜射|风骚|食精|骚b|骚嘴|骚女|骚妇|骚水|骚浪|骚穴|骚货|骚贱贱|骚逼|高潮|鬼畜抄|魅惑|鸡吧|鸡奸|鸡巴|黄片|黄网|黄色网站|黑丝|黑逼|龟头|🐶🐶|🔞|🫦🫦🫦";
  const words = keywordsString.split("|");
  return words;
})();

// GPT 给出的关键词，我啥也不知道
function isPornography(str) {
  return words.some((s) => str.includes(s));
}

function parseTwitterResponserInfo(response) {
  const entries = response.data.threaded_conversation_with_injections_v2.instructions[0].entries;
  const conversationEntries = entries.filter((entry) => entry.entryId.includes("conversationthread-"));
  const resultList = conversationEntries.map((entry) => {
    const result = entry.content.items[0].item.itemContent.tweet_results.result;
    return result;
  });

  const userInfo = resultList
    .map((result) => {
      // "TweetWithVisibilityResults" | "Tweet"
      if (result.__typename !== "Tweet") return;

      const full_text = result.legacy.full_text;
      const following = result.core.user_results.result.legacy.following;
      const description = result.core.user_results.result.legacy.description;
      const name = result.core.user_results.result.legacy.name;
      const screen_name = result.core.user_results.result.legacy.screen_name;
      const avatar = result.core.user_results.result.legacy.profile_image_url_https;
      const restId = result.core.user_results.result.rest_id;

      let isPorn = false;
      let field = "";
      if (isPornography(full_text)) {
        isPorn = true;
        field = "full_text";
      } else if (isPornography(description)) {
        isPorn = true;
        field = "description";
      } else if (isPornography(name)) {
        isPorn = true;
        field = "name";
      } else if (isPornography(screen_name)) {
        isPorn = true;
        field = "screen_name";
      }

      // whitelist
      const whiteList = localStorage.getItem("twitter_responser_whitelist")
        ? JSON.parse(localStorage.getItem("twitter_responser_whitelist"))
        : [];
      const matchedWhiteList = whiteList.some((item) => item.screen_name === screen_name);
      if (matchedWhiteList) {
        isPorn = false;
      }

      // `user` who you are `following`
      if (following) {
        isPorn = false;
      }

      const user = {
        full_text,
        description,
        name,
        screen_name,
        isPorn,
        field,
        restId,
        avatar,
      };

      return user;
    })
    .filter(Boolean);

  return userInfo;
}

function hijackXHR() {
  const XHR = XMLHttpRequest.prototype;
  const open = XHR.open;
  const send = XHR.send;
  const setRequestHeader = XHR.setRequestHeader;

  XHR.open = function () {
    return open.apply(this, arguments);
  };

  XHR.setRequestHeader = function () {
    return setRequestHeader.apply(this, arguments);
  };

  XHR.send = function () {
    this.addEventListener("load", function () {
      const url = this.responseURL;
      try {
        if (this.responseType != "blob") {
          let responseBody;
          if (this.responseType === "" || this.responseType === "text") {
            responseBody = JSON.parse(this.responseText);
          } else {
            responseBody = this.response;
          }

          // only hijack TweetDetail API
          if (url.includes("TweetDetail")) {
            const responserInfo = parseTwitterResponserInfo(responseBody);

            const pornList = responserInfo.filter((item) => item.isPorn);

            let list = localStorage.getItem("twitter_responser_porn_list")
              ? JSON.parse(localStorage.getItem("twitter_responser_porn_list"))
              : [];

            if (list.length > 5000) {
              // 防止数据过大
              list = [];
            }
            const newList = mergeAndUnique(list, pornList);
            localStorage.setItem("twitter_responser_porn_list", JSON.stringify(newList));
          }
        }
      } catch (err) {
        console.debug("Error reading or processing response.", err);
      }
    });

    return send.apply(this, arguments);
  };
}
hijackXHR();
